In [10]:
#A DataFrame in pandas is a two-dimensional labeled data structure, similar to a table in a database or an Excel spreadsheet. 
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)
print('\n')
import numpy as np
data = np.array([
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
])
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)
print('\n')
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}
]
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago


      Name Age         City
0    Alice  25     New York
1      Bob  30  Los Angeles
2  Charlie  35      Chicago


      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [13]:
df1 = pd.read_csv("C:/Users/vinay/Desktop/JavaScript/Python/numpy/Datasets-main/Datasets-main/company.csv")
print(df1)

   Unnamed: 0      Name gender  salary
0           0    ayushi      F   20000
1           1     rohit      M   25000
2           2  pranjali      F   27000

pip install openpyxl

In [20]:
df2 = pd.read_excel("C:/Users/vinay/Desktop/JavaScript/Python/numpy/Datasets-main/Datasets-main/expense3.xlsx")
print(df2)
print(df2.info())

         Date    Category       Sub-Category   Amount Payment Mode
0  2023-01-01     Grocery             Grocery      30         Cash
1  2023-01-02        Food          Restaurant     890          UPI
2  2023-01-04         123              Zomato     257          NaN
3  2023-01-06  Essentials               Diary     120          UPI
4  2023-01-06  Essentials             Perfume    1500         Cash
5  2023-01-09     Grocery  Fruits and Veggies     456         Cash
6  2023-01-10       Bills          House Rent   16000          UPI
7  2023-01-10     Grocery      Tomato KetchUp      70          UPI
8  2023-01-12        Food                Chai      15          UPI
9  2023-01-15  Essentials      Salt and Sugar      50          NaN
10 2023-01-17     Grocery           Chocolate     100          UPI
11 2023-01-17        Food          Restaurant     780         Card
12 2023-01-18  Essentials            Food Oil     120          NaN
13 2023-01-18        Food              Zomato     230          UPI
14 2023-01-19     Grocery                Milk      26          UPI
15 2023-01-20  Essentials             Shampoo     780          UPI
16 2023-01-20  Essentials           Lunch Box     890         Cash
17 2023-01-21     Clothes               Dress    1000          NaN
18 2023-01-22     Clothes               Dress    1890          UPI
19 2023-01-23     Grocery      Bread and Milk      56         Cash
20 2023-01-24        Food  Fruits and Veggies     530         Cash
21 2023-01-26        Food                Chai      10          UPI
22 2023-01-26     Grocery               Maggi     140          UPI
23 2023-01-27        Food              Zomato     300          UPI
24 2023-01-27        Food                Chai      10          UPI
25 2023-01-28  Essentials           Bedsheets    1025         Cash
26 2023-01-29       Bills             Mobile     1650          UPI
27 2023-01-29     Grocery                Daal     150         Cash
28 2023-01-30       Bills            Cylinder    1074          UPI
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           29 non-null     datetime64[ns]
 1   Category       29 non-null     object
 2   Sub-Category   29 non-null     object
 3   Amount         29 non-null     int64
 4   Payment Mode   25 non-null     object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 1.3+ KB
None

In [23]:
df2.describe()

                                Date        Amount
count                             29     29.000000
mean   2023-01-17 19:02:04.137931008   1039.620690
min              2023-01-01 00:00:00     10.000000
25%              2023-01-10 00:00:00     70.000000
50%              2023-01-19 00:00:00    257.000000
75%              2023-01-26 00:00:00    890.000000
max              2023-01-30 00:00:00  16000.000000
std                              NaN   2927.684353

In [25]:
print(df2.isnull().sum())

Date             0
Category         0
Sub-Category     0
Amount           0
Payment Mode     4
dtype: int64

handling dupplicate values in datframe

In [27]:
df1 = pd.read_csv("C:/Users/vinay/Desktop/JavaScript/Python/numpy/Datasets-main/Datasets-main/company1.csv")
print(df1)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [30]:
print(df1['EEID'].duplicated().sum())

2

In [31]:
print(df1.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

Method	Description
isna() / isnull()	Identify missing values.
notna() / notnull()	Identify non-missing values.
dropna()	Remove rows/columns with missing values.
fillna()	Fill missing values with a specific value.
replace()	Replace missing data with specific values.
interpolate()	Estimate missing values.

In [47]:
#Drop Rows with Any Missing Values
#Drop Rows with Any Missing Values

df_cleaned = df.dropna()
print(df_cleaned)
#Drop Rows with All Missing Values
df_cleaned = df.dropna(how='all')
print(df_cleaned)
#Drop Columns with Missing Values
df_cleaned = df.dropna(axis=1)
print(df_cleaned)
#Drop Rows with Threshold of Non-NA Values
df_cleaned = df.dropna(thresh=2)  # Keep rows with at least 2 non-NA values
print(df_cleaned)

 students.dropna(subset =['name'],inplace=True)
    return students #delete rows with column subset 'name'

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
#Filling Missing Data
#fillna(): Fills missing values with a specified value or method.
df_filled = df.fillna(value={'Name': 'Unknown', 'Age': 0, 'City': 'N/A'})
print(df_filled)

#Fill with Mean, Median, or Mode
df['Age'] = df['Age'].fillna(df['Age'].mean())  # Fill with mean
print(df)

#Forward Fill (Fill with Previous Value)
df_filled = df.fillna(method='ffill')
print(df_filled)

#Backward Fill (Fill with Next Value)
df_filled = df.fillna(method='bfill')
print(df_filled)

In [42]:
#replace a missing value with any or specific value
import numpy as np
print(df1.replace(np.nan,3000))

    EEID      Name gender   salary
0  EMP01    ayushi      F   3000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali   3000  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05      3000      M  25000.0
5  EMP06     rohit      M   3000.0
6  EMP02     rohit      M  25000.0

In [44]:
df1['salary'] = df1["salary"].replace(np.nan,3000)

In [45]:
print(df1)

    EEID      Name gender   salary
0  EMP01    ayushi      F   3000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M   3000.0
6  EMP02     rohit      M  25000.0

Summary of Transformation Techniques
Transformation Type	Method/Function
Add/Modify Columns	         df['col'] = value, assign()
Rename Columns	             rename()
Apply Conditional Logic	     apply(), np.where()
Mathematical Operations	     apply(), transform()
Arithmetic operators,
 
String Operations	         str.upper(), str.replace(), str.extract()
Aggregation	            `    groupby().transform()
Missing Value Handling	     fillna(), dropna()
Scaling	                     Min-Max scaling, Standardization
One-Hot Encoding	         pd.get_dummies()

In [ ]:
# Add a new column
df['Country'] = 'USA'
print(df)

df['Age'] = df['Age'] + 5  # Add 5 years to each age
print(df)
#Rename Columns
df.rename(columns={'City': 'Location'}, inplace=True)
print(df)

In [ ]:
# so its like if bonus value is 0 then in tbat 
df.loc[(df["bonus %"]==0),"getbonus"] = "no bonus"
df.loc[(df["bonus %"]>0),"getbonus"] = "no bonus"

In [ ]:
# Add a column based on a condition
df['Senior Citizen'] = df['Age'].apply(lambda x: 'Yes' if x >= 30 else 'No')
print(df)

In [ ]:
df['Age'] = df['Age'].fillna(df['Age'].mean())  # Fill missing values with the mean
print(df)

# Add a column based on a condition
df['Senior Citizen'] = df['Age'].apply(lambda x: 'Yes' if x >= 30 else 'No')
print(df)

In [ ]:
grouped = df.groupby('City')['Age'].transform('mean')  # Mean age for each city
df['City_Avg_Age'] = grouped
print(df)
#Group and Transform Data

df['Age_Doubled'] = df['Age'].apply(lambda x: x * 2)
print(df)
#Apply a Function to a Column 
#Apply a Function to Multiple Columns
def combine_name_age(row):
    return f"{row['Name']} ({row['Age']})"

df['Name_Age'] = df.apply(combine_name_age, axis=1)
print(df)

In [ ]:
#. One-Hot Encoding for Categorical Columns
df = pd.get_dummies(df, columns=['City'], prefix='City')
print(df)

Transformation Type	Method/Function
Add/Modify Columns	           df['col'] = value, assign()
Rename Columns	               rename()
Apply Conditional Logic	       apply(), np.where()
Mathematical Os	Arithmetic o   apply(), transform()
String Operations	           str.upper(), str.replace(), str.extract()
Aggregation	                   groupby().transform()
Missing Value Handling	       fillna(), dropna()
Scaling	                       Min-Max scaling, Standardization
One-Hot Encoding	           |pd.get_dummies()

In [4]:
import pandas as pd

data = {
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles'],
    'Population': [8000, 4000, 7500, 2700, 4200],
    'Sales': [200, 150, 250, 100, 180]
}
df = pd.DataFrame(data)
print(df)
# Group by 'City' and calculate total sales for each city
grouped = df.groupby('City')['Sales'].sum()
print(grouped)

g = df.groupby('City')['Sales'].max()
print(g)

          City  Population  Sales
0     New York        8000    200
1  Los Angeles        4000    150
2     New York        7500    250
3      Chicago        2700    100
4  Los Angeles        4200    180
City
Chicago        100
Los Angeles    330
New York       450
Name: Sales, dtype: int64
City
Chicago        100
Los Angeles    180
New York       250
Name: Sales, dtype: int64

transform():
Used with groupby() to perform operations on each group while returning a DataFrame or Series of the same shape as the original data.
Each value in the column is replaced with the result of a group-level operation

In [5]:
# Add a column showing the mean sales for each city
df['Mean_Sales_Per_City'] = df.groupby('City')['Sales'].transform('mean')
print(df)

          City  Population  Sales  Mean_Sales_Per_City
0     New York        8000    200                225.0
1  Los Angeles        4000    150                165.0
2     New York        7500    250                225.0
3      Chicago        2700    100                100.0
4  Los Angeles        4200    180                165.0

 join()
Combines two DataFrames based on their index.
Default type is left join.
df1.join(df2, how='join_type', on=key)
how: Type of join ('left', 'right', 'outer', 'inner').
on: Specifies columns for the join if not using the index.

In [6]:
import pandas as pd

df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

df2 = pd.DataFrame({
    'Score': [85, 90, 75]
}, index=[1, 2, 3])

# Join based on index
result = df1.join(df2)
print(result)

   ID     Name  Score
1   1    Alice     85
2   2      Bob     90
3   3  Charlie     75

2. merge()
Combines datasets based on one or more common columns or index.
Flexible for one-to-one, many-to-one, and many-to-many relationships.
pd.merge(df1, df2, how='join_type', on='column', left_on='col1', right_on='col2')
how: Type of join ('inner', 'outer', 'left', 'right').
on: Common column(s) for the merge.
left_on/right_on: Use different columns from each DataFrame for joining

In [7]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Score': [85, 90, 88]
})

# Merge on ID
result = pd.merge(df1, df2, how='inner', on='ID')
print(result)

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90